multiscaleModeling/project/01microFracture/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    /*
    {
        type            uniformFixedValue;
        uniformValue
        {
        	type				csvFile;
        	nHeaderLine			0;
        	refColumn			0;
        	componentColumns	(1);
        	separator			",";
        	mergeSeparators		no;
        	file				"pInlet.csv";
        }
    }
    */

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    /*    
    {
        type            uniformFixedValue;
        uniformValue
        {
        	type				csvFile;
        	nHeaderLine			0;
        	refColumn			0;
        	componentColumns	(1);
        	separator			",";
        	mergeSeparators		no;
        	file				"pOutlet.csv";
        }
    }
    */

    upperWall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
